pipeFlow/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale	1;

radius1		 0.01;

x0			 0;
x1  	     #calc "$x0 - 2.0";

s1			 #calc "$radius1 / 4.0";
s2			 #calc "$radius1 / (-4.0)";

c1			 #calc "$radius1 * 0.8";
c2			 #calc "$radius1 * (-0.8)";

geometry
{

    cylinder
    {
        type    searchableExtrudedCircle;
        file    "line.vtk";
        radius  $radius1;
    }

}

vertices
(
			($x0 $s2 $s1)
	project ($x0 $c2 $c1) (cylinder)
	project ($x0 $c1 $c1) (cylinder)
			($x0 $s1 $s1)

			($x0 $s1 $s2)
	project ($x0 $c1 $c2) (cylinder)
	project ($x0 $c2 $c2) (cylinder)
			($x0 $s2 $s2)

			($x1 $s2 $s1)
	project ($x1 $c2 $c1) (cylinder)
	project ($x1 $c1 $c1) (cylinder)
			($x1 $s1 $s1)

			($x1 $s1 $s2)
	project ($x1 $c1 $c2) (cylinder)
	project ($x1 $c2 $c2) (cylinder)
			($x1 $s2 $s2)
);

blocks
(

	hex (0 1 2 3 8 9 10 11) 	(25 25 200) simpleGrading  	( 40 1 1)
	hex (3 2 5 4 11 10 13 12) 	(25 25 200) simpleGrading  	( 40 1 1)
	hex (4 5 6 7 12 13 14 15) 	(25 25 200) simpleGrading  	( 40 1 1)
	hex (7 6 1 0 15 14 9 8) 	(25 25 200) simpleGrading  	( 40 1 1)
	hex (0 3 4 7 8 11 12 15) 	(25 25 200) simpleGrading 	( 1 1 1)

);

edges
(

	project 1 2 (cylinder)
	project 2 5 (cylinder)
	project 5 6 (cylinder)
	project 6 1 (cylinder)

	project 9 10 (cylinder)
	project 10 13 (cylinder)
	project 13 14 (cylinder)
	project 14 9 (cylinder)
);

faces
(
);


defaultPatch
{
    name walls;
    type wall;
}

boundary
(
    inlet
	{
		type	patch;
		faces
		(
			(0 1 2 3)
			(3 2 5 4)
			(4 5 6 7)
			(7 6 1 0)
			(0 3 4 7)
		);
	}

	outlet
	{
		type	patch;
		faces
		(
			(8 9 10 11)
			(11 10 13 12)
			(12 13 14 15)
			(15 14 9 8)
			(8 11 12 15)
		);
	}
);

// ************************************************************************* //
